
//--------------------------------------<                        axlib v1.1                             >-------------------------------------------
//--------------------------------------<      Библиотека для работы с инкрементальным энкодером        >-------------------------------------------
//--------------------------------------<          Кузнецов Алексей 2015 http://www.avrki.ru            >-------------------------------------------


#ifndef ENCODER_H_
#define ENCODER_H_

#if !defined(MAIN_INIT_H_)
#error "You must included (#include \"main_init.h\") befor use (#include <axlib/encoder.h>)."
#endif




#endif /* ENCODER_H_ */